<template>
  <main>
    <img class="size--max-parent about-subject__main-image align--center block" src="../../assets/images/logomain.jpg" alt="">
    <h1>Проектування інформаційних систем</h1>
    <p>Метою курсу є вивчення особливостей і можливостей інформаційних систем, визначення меж використання інформаційних
      систем у різних сферах людської діяльності. Особливу увагу приділено проектуванню прикладних інформаційних систем.
      Одна з основних цілей дисципліни - сформувати загальне уявлення про роль і характер інформаційних систем в різних
      областях людської діяльності.
      У лекціях викладені основні поняття і класифікація інформаційних систем, життєвий цикл інформаційних систем,
      моделі життєвого циклу ІС, стандарти та методики.</p>

     <p> Даний курс базується на знаннях загальних і профілюючих дисциплін. Навчальним планом для цієї дисципліни
      відводиться: загальна кількість лекційних годин - 32 години, практичних годин - 14 години, лабораторних годин - 14
      годин. </p>
  </main>
</template>

<script>
  export default {
    name: "AboutSubject"
  };
</script>

<style lang="scss" scoped>
  .about-subject__main-image{
    max-width: 70%;
  }
</style>
