<template>
  <main>
    <AboutProgram class="clearfix" heading="ERWin Process Modeler" link="https://itteach.ru/bpwin/skachat-erwin">
      <template slot="image">
        <img class="about-programs__illustration" src="../../assets/images/programs/erwin.jpg">
      </template>

      <p>CA ERwin Process Modeler - це програмний продукт компанії Computer Associeties BPWIN,
        призначений для моделювання бізнес процесів. Нова версія відрізняється від попередньої в першу чергу це
        сумісності з операційними система Vista, Windows 7. По друге в новій версії даного продукту розробники значно
        розширили функціональні можливості програми.
      </p>
      <p>CA ERwin Process Modeler (раніше BPwin) - інструмент для моделювання, аналізу, документування та оптимізації
        бізнес-процесів. CA ERwin Process Modeler можна використати для графічного представлення бізнес-процесів.
        Графічно представлена схема виконання робіт, обміну інформацією, документообігу візуалізує модель
        бізнес-процесу. Графічне викладення цієї інформації дозволяє перевести завдання управління організацією з
        області складного ремесла в сферу інженерних технологій.
      </p>
      <p>CA ERwin Process Modeler (BPwin) допомагає чітко документувати важливі аспекти будь-яких бізнес-процесів: дії,
        які необхідно зробити, способи їх здійснення і контролю, потрібні для цього ресурси, а також візуалізувати
        отримані від цих дій результати. CA ERwin Process Modeler підвищує бізнес-ефективність ІТ-рішень, дозволяючи
        аналітикам і проектувальникам моделей співвідносити корпоративні ініціативи та завдання з бізнес-вимогами і
        процесами інформаційної архітектури та проектування додатків. Таким чином, формується цілісна картина діяльності
        підприємства: від потоків робіт у невеликих підрозділах до складних організаційних функцій.
      </p>
    </AboutProgram>
    <AboutProgram class="clearfix" heading="Rational Rose" link="https://itteach.ru/rational-rose/">
      <template slot="image">
        <img class="about-programs__illustration" src="../../assets/images/programs/rational.jpg" alt="">
      </template>

      <p>IBM Rational Rose - популярний засіб візуального моделювання, яке вважається стандартом де-факто серед засобів
        візуального проектування програм. Цей продукт входить до складу пакета IBM Rational Suite і призначений для
        моделювання програмних систем з використанням широкого кола інструментальних засобів і платформ. Інструментальне
        засіб IBM Rational Rose розширює можливості моделювання програмних систем, що виходять за межі платформи J2EE і
        інструментальних засобів моделювання у складі IBM Rational Professional Bundle.
      </p>
      <p>
        Будучи простим і потужним рішенням для візуальної розробки інформаційних систем будь-якого класу, Rational Rose
        дозволяє створювати, змінювати і перевіряти коректність моделі. Rational Rose об'єднує команду розробників на
        базі універсальної мови моделювання UML, який визначає стандартну графічну символіку для опису архітектури.
        Будь-які учасники проекту - аналітики, фахівці з моделювання, розробники і інші - можуть використовувати моделі,
        побудовані в Rational Rose, для більшої ефективності створення кінцевого продукту.</p>
    </AboutProgram>
  </main>
</template>

<script>
  import AboutProgram from "./AboutProgram";

  export default {
    name: "AboutPrograms",
    components: {AboutProgram}
  }
</script>

<style lang="scss" scoped>

  .about-programs__illustration{
    max-width: 50%;
  }

  .clearfix:after {
    clear: both;
    content: '';
  }

</style>
